In [1]:
#lambda function

lambda arguments : expression

In [ ]:
def fun(n):
    return n%2==0;

In [2]:
def doubleFun(n):
    return n*2

x = lambda a : a*2

print(x(10))
print(doubleFun(10))

20
20

In [3]:
x = lambda a,b,c : a+b-c

print(x(3,2,1))

4

In [7]:
# inside another function

def multiFun(n):
    return lambda a: a*n

doubler = multiFun(2) #lambda a:a*2

print(doubler(14))

28

In [8]:
tripler = multiFun(3) #lambda a:a*3

print(tripler(14))

42

In [10]:
# inside another function

def multiFun(n):
    return lambda a: a*n

doubler = multiFun(2) #lambda a:a*2
print(doubler(14))
print(doubler(15))
print(doubler(25))
print(doubler(28))

tripler = multiFun(3) #lambda a:a*3
print(tripler(14))
print(tripler(24))
print(tripler(8))
print(tripler(10))

28
30
50
56
42
72
24
30

In [11]:
# return reverse of string

x = lambda string : string[::-1]
print(x("hi this is lambda"))

adbmal si siht ih

In [12]:

x = lambda string : string.upper()[::-1]
print(x("hi this is lambda"))

ADBMAL SI SIHT IH

In [14]:
# if else within lambda

str_format = lambda strn : f"{strn:e}" if isinstance(strn,int) else f"{strn:,.2f}" 
print(str_format(100))
print(str_format(34332.643754))

1.000000e+02
34,332.64

In [ ]:
# if num divisible by 2

In [16]:
# use multiple statements

list1 = [[1,4,3],[2,5,6,4,1],[5,7,9,6,4],[5,9,10,8,7]]

sortList = lambda x : (sorted(le) for le in x)

secLarge = lambda x,fun : [y[len(y)-2] for y in fun(x)]

print(secLarge(list1,sortList))

[3, 5, 7, 9]

In [17]:
list2 = [2,5,4,7,8,9,10,13,15,42,26,34,44,57,65,78,88]
# even numbers , use filter() and lambda

# filter(cond,input)

even = list(filter(lambda x : (x%2==0), list2))
print(even)

[2, 4, 8, 10, 42, 26, 34, 44, 78, 88]

In [ ]:
# summarized tabular data
# pandas

In [19]:
import pandas as pd
dataframe = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [20]:
print(dataframe)

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [21]:
dataframe.describe()

              D         E
count  9.000000  9.000000
mean   3.666667  6.000000
std    2.000000  2.345208
min    1.000000  2.000000
25%    2.000000  5.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [22]:
# replacement for dataframe.groupby() is pd.pivot_table()

dataframe.groupby('A')['D'].mean()

A
bar    5.5
foo    2.2
Name: D, dtype: float64

In [23]:
dataframe.groupby('B')['D'].mean()

B
one    2.80
two    4.75
Name: D, dtype: float64

In [25]:
import numpy as np
tbl = pd.pivot_table(dataframe,values='D',index=['A'],columns='C',aggfunc=np.mean)
print(tbl)

C    large     small
A
bar    5.5  5.500000
foo    2.0  2.333333

In [26]:
tbl = pd.pivot_table(dataframe,values='D',index=['B'],columns='C',aggfunc=np.mean)
print(tbl)

C       large  small
B
one  2.666667    3.0
two  7.000000    4.0

In [27]:
tbl = pd.pivot_table(dataframe,values='D',index=['A','B'],columns='C',aggfunc=np.mean)
print(tbl)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    2.0    1.0
    two    NaN    3.0

In [31]:
tbl = pd.pivot_table(dataframe,values='D',index=['A','B'],columns='C',aggfunc=np.mean,fill_value=0)
print(tbl)

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      2      1
    two      0      3

In [33]:
tbl = pd.pivot_table(dataframe,values='D',index=['A','B'],columns='C',aggfunc=np.sum,fill_value=0)
print(tbl)

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [34]:
tbl = pd.pivot_table(dataframe,values='D',index=['A','B'],columns='C',aggfunc=np.max,fill_value=0)
print(tbl)

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      2      1
    two      0      3

In [36]:
tbl = pd.pivot_table(dataframe,values=['D','E'],index=['A','B'],columns='C',aggfunc={'D':np.sum,'E':np.mean},fill_value=0)
print(tbl)

            D           E
C       large small large small
A   B
bar one     4     5   6.0   8.0
    two     7     6   9.0   9.0
foo one     4     1   4.5   2.0
    two     0     6   0.0   5.5

In [41]:
tbl = pd.pivot_table(dataframe,values=['D','E'],index=['B'],columns='C',aggfunc={'D':np.sum,'E':np.mean},fill_value=0)
tbl

        D           E
C   large small large     small
B
one     8     6     5  5.000000
two     7    12     9  6.666667

In [40]:
tbl = pd.pivot_table(dataframe,values=['D','E'],index=['B'],columns='C',aggfunc={'D':np.sum,'E':[min,max,np.mean]},fill_value=0)
tbl

        D           E
      sum         max        mean             min
C   large small large small large     small large small
B
one     8     6     6     8     5  5.000000     4     2
two     7    12     9     9     9  6.666667     9     5